package javaStudy;
/*
 * 자바의 기본: 위에 있는 패키지는 나중에 배움
 * 
 * 주의사항
 * 1. 아해의 소스코드에서 보라색은 키워드(단어 자체가 의미를 내포하고 있다는 뜻)임
 * 이 키워드를 변수나 클래스 아름 등으로 사용하면 절대 안 됨
 * 
 * 2. 아래의 public은 있든 없든 상관없음 신경 안 써도 됨
 * 
 * 3. 모든 키워드와 키워드. 클래스 이름 중간에는 반드시 공백이 들어가야 인식함
 * 공백이 없으면 하나의 단어로 인식
 * 
 * 4. 클래스 이름 옆에는 반드시 {}를 사용하고 앞으로 {}를 클래스 옆에 붙은, 클래스를 정의한
 * 내용이 있는 블락이라고 해서 클래스 바디(body)라고 부름
 * 
 * 5. 클래스 이름은 반드시 첫자를 대문자로 시작해야 함
 * 
 * 6. 자바 내의 데이터를 제외한 모든 코드에는 한글 사용 안 됨
 * 
 * 7. 클래스명에 특문은 숫자, $, _ 등만 허용됨 단, 숫자는 맨앞에 올 수 없음 (컴파일 에허)
 * 
 * 8. 자바는 문법에 매우 엄격하기 때문에 모든 실행, 선언, 초기화 구문 끝에는 반드시 ;를 사용해서
 * 구문을 구분시킴
 * 
 * 9. 하나의 자바 소스 파일 내에는 하나 이상의 클래스를 정의할 수 있음
 * 단, public 키워드는 단 하나의 클래스만 가질 수 있고 한 번 이상 사용하면 에러
 * 또한 이 public을 가진 클래스가 대표 클래스가 되고 main 메서드를 갖게 되며 파일명을 이 클래스명으로 함 
 */


public class SyntaxEx {
	
}
